IDENTIFICATION DIVISION.
PROGRAM-ID. CALCPI.
DATA DIVISION.
WORKING-STORAGE SECTION.
           01  WK-PGM-NAME     PIC  X(008) VALUE "CALCPI  ".
01 N PIC 9(9) VALUE 1000000.
01 I PIC 9(9).
01 PI-APPROX PIC 9(10)V9(8).
01 WSIGN PIC S9 VALUE 1.
01 CALCULATION-ERROR PIC 9(10)V9(8).
*>01 START-TIME PIC 9(10)V9(8).
*>01 END-TIME PIC 9(10)V9(8).
01 START-TIME PIC 9(8).
01 END-TIME PIC 9(8).
01 ELAPSED-MILLISEC PIC 9(10)V9(8).

           COPY    CPDATETIMEF  REPLACING ==:##:== BY ==WDT==.
PROCEDURE DIVISION.

           DISPLAY WK-PGM-NAME " START"

           MOVE    WK-PGM-NAME TO      WDT-DATE-TIME-PGM
           MOVE    "S"         TO      WDT-DATE-TIME-ID
           CALL    "DATETIME"  USING   WDT-DATETIME-AREA
*>    MOVE FUNCTION CURRENT-DATE TO START-TIME.
    ACCEPT START-TIME FROM TIME.
    MOVE 0 TO PI-APPROX.
    PERFORM VARYING I FROM 0 BY 1 UNTIL I >= N
        COMPUTE PI-APPROX = PI-APPROX + (WSIGN / (2 * I + 1))
        MULTIPLY -1 BY WSIGN GIVING WSIGN
    END-PERFORM.
    COMPUTE PI-APPROX = PI-APPROX * 4.
    COMPUTE CALCULATION-ERROR = 3.14159265 - PI-APPROX.
*>    MOVE FUNCTION CURRENT-DATE TO END-TIME.
    ACCEPT END-TIME FROM TIME.
*>    COMPUTE ELAPSED-MILLISEC = FUNCTION INTEGER-OF-TIME(END-TIME) - FUNCTION INTEGER-OF-TIME(START-TIME).
    COMPUTE ELAPSED-MILLISEC = END-TIME - START-TIME.
    DISPLAY "â~é¸ó¶ãﬂéóíl  : " PI-APPROX
    DISPLAY "åvéZåÎç∑      : " CALCULATION-ERROR
    DISPLAY "åoâﬂéûä‘[msec]: " ELAPSED-MILLISEC.

           DISPLAY START-TIME
           DISPLAY END-TIME
           MOVE    "E"         TO      WDT-DATE-TIME-ID
           CALL    "DATETIME"  USING   WDT-DATETIME-AREA
           .
    STOP RUN.
