IDENTIFICATION DIVISION.
PROGRAM-ID. DEMOMATH.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 Begin-Time.
05 BT-HH PIC 9(2).
05 BT-MM PIC 9(2).
05 BT-SS PIC 9(2).
05 BT-HU PIC 9(2).
01 Binary-Item BINARY-LONG SIGNED VALUE 0.
01 Comp-Item COMP PIC S9(9) VALUE 0.
01 Comp-5-Item COMP-5 PIC S9(9) VALUE 0.
01 Display-Item DISPLAY PIC S9(9) VALUE 0.
01 End-Time.
05 ET-HH PIC 9(2).
05 ET-MM PIC 9(2).
05 ET-SS PIC 9(2).
05 ET-HU PIC 9(2).
78 Repeat-Count VALUE 10000000.
01 Time-Diff PIC ZZ9.99.
PROCEDURE DIVISION.
010-Test-Usage-DISPLAY.
ACCEPT Begin-Time FROM TIME END-ACCEPT
PERFORM Repeat-Count TIMES ADD 7 TO Display-Item END-PERFORM
PERFORM 100-Determine-Time-Diff
DISPLAY 'USAGE DISPLAY: ' Time-Diff ' SECONDS' END-DISPLAY.
020-Test-Usage-COMP.
ACCEPT Begin-Time FROM TIME END-ACCEPT
PERFORM Repeat-Count TIMES ADD 7 TO Comp-Item END-PERFORM
PERFORM 100-Determine-Time-Diff
DISPLAY 'USAGE COMP   : ' Time-Diff ' SECONDS' END-DISPLAY.
030-Test-Usage-COMP-5 .
ACCEPT Begin-Time FROM TIME END-ACCEPT
PERFORM Repeat-Count TIMES ADD 7 TO Comp-5-Item END-PERFORM
PERFORM 100-Determine-Time-Diff
DISPLAY 'USAGE COMP-5 : ' Time-Diff ' SECONDS' END-DISPLAY.
040-Test-Usage-BINARY.
ACCEPT Begin-Time FROM TIME END-ACCEPT
PERFORM Repeat-Count TIMES ADD 7 TO Binary-Item END-PERFORM
PERFORM 100-Determine-Time-Diff
DISPLAY 'USAGE BINARY : ' Time-Diff ' SECONDS' END-DISPLAY.
099-Done.
STOP RUN.
100-Determine-Time-Diff.
ACCEPT End-Time FROM TIME END-ACCEPT
COMPUTE Time-Diff =
( (ET-HH * 360000 + ET-MM * 6000 + ET-SS * 100 + ET-HU)
- (BT-HH * 360000 + BT-MM * 6000 + BT-SS * 100 + BT-HU) )
/ 100.
