 IDENTIFICATION DIVISION.
 PROGRAM-ID. USAGELengths.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 Len-BINARY-C-LONG CONSTANT AS LENGTH OF BINARY-C-LONG.
 01 Len-BINARY-CHAR CONSTANT AS LENGTH OF BINARY-CHAR.
 01 Len-BINARY-DOUBLE CONSTANT AS LENGTH OF BINARY-DOUBLE.
 01 Len-BINARY-LONG CONSTANT AS LENGTH OF BINARY-LONG.
 01 Len-BINARY-SHORT CONSTANT AS LENGTH OF BINARY-SHORT.
 01 Len-COMP-1 CONSTANT AS LENGTH OF COMP-1.
 01 Len-COMP-2 CONSTANT AS LENGTH OF COMP-2.
 01 Len-FLOAT-DECIMAL-16 CONSTANT AS LENGTH OF FLOAT-DECIMAL-16.
 01 Len-FLOAT-DECIMAL-34 CONSTANT AS LENGTH OF FLOAT-DECIMAL-34.
 01 Len-FLOAT-LONG CONSTANT AS LENGTH OF FLOAT-LONG.
 01 Len-FLOAT-SHORT CONSTANT AS LENGTH OF FLOAT-SHORT.
 01 Len-POINTER CONSTANT AS LENGTH OF POINTER.
 01 Len-PROGRAM-POINTER CONSTANT AS LENGTH OF PROGRAM-POINTER.
 PROCEDURE DIVISION.
 000-Main.
 DISPLAY "On this system, with this build of GNU COBOL, the"
 DISPLAY "PICTURE-less USAGEs have these lengths (in bytes):"
 DISPLAY " "
 DISPLAY "BINARY-C-LONG: " Len-BINARY-C-LONG
 DISPLAY "BINARY-CHAR: " Len-BINARY-CHAR
 DISPLAY "BINARY-DOUBLE: " Len-BINARY-DOUBLE
 DISPLAY "BINARY-LONG: " Len-BINARY-LONG
 DISPLAY "BINARY-SHORT: " Len-BINARY-SHORT
 DISPLAY "COMP-1: " Len-COMP-1
 DISPLAY "COMP-2: " Len-COMP-2
 DISPLAY "FLOAT-DECIMAL-16: " Len-FLOAT-DECIMAL-16
 DISPLAY "FLOAT-DECIMAL-34: " Len-FLOAT-DECIMAL-34
 DISPLAY "FLOAT-LONG: " Len-FLOAT-LONG
 DISPLAY "FLOAT-SHORT: " Len-FLOAT-SHORT
 DISPLAY "POINTER: " Len-POINTER
 DISPLAY "PROGRAM-POINTER: " Len-PROGRAM-POINTER 
  STOP RUN
 .
